In [1]:
%load_ext sql
%sql mysql://root:root@localhost/testing_system_db

In [2]:
%%sql
SHOW TABLES;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[('account',),
 ('answer',),
 ('categoryquestion',),
 ('department',),
 ('exam',),
 ('examquestion',),
 ('group',),
 ('groupaccount',),
 ('position',),
 ('question',),
 ('typequestion',)]

# Question 1. Tạo view có chứa danh sách nhân viên thuộc phòng Engineering

In [14]:
%%sql
SELECT      a.AccountID, a.FullName, d.DepartmentName
FROM        account     AS  a
LEFT JOIN   department  AS  d   ON  d.DepartmentID = a.DepartmentID
WHERE       d.DepartmentName = 'Engineering';

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(2, 'John Doe', 'Engineering'),
 (6, 'Sarah Wilson', 'Engineering'),
 (7, 'Christopher Lee', 'Engineering'),
 (15, 'Alice Smith', 'Engineering'),
 (16, 'Bob Jones', 'Engineering')]

In [15]:
%%sql
CREATE VIEW     ENG_DEPT_VIEW AS
SELECT          a.AccountID, a.FullName, d.DepartmentName
FROM            account     AS  a
LEFT JOIN       department  AS  d   ON  d.DepartmentID = a.DepartmentID
WHERE           d.DepartmentName = 'Engineering';

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [17]:
%%sql
SELECT  *
FROM    ENG_DEPT_VIEW;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(2, 'John Doe', 'Engineering'),
 (6, 'Sarah Wilson', 'Engineering'),
 (7, 'Christopher Lee', 'Engineering'),
 (15, 'Alice Smith', 'Engineering'),
 (16, 'Bob Jones', 'Engineering')]

# Question 2. Tạo View có chứa thông tin các Account tham gia vào nhiều Group nhất

In [21]:
%%sql
SELECT      AccountID, COUNT(GroupID) AS NUM_GROUP
FROM        GroupAccount
GROUP BY    AccountID
HAVING      NUM_GROUP = 3;

 * mysql://root:***@localhost/testing_system_db
7 rows affected.

[(1, 3), (2, 3), (3, 3), (6, 3), (7, 3), (15, 3), (16, 3)]

In [22]:
%%sql
SELECT  MAX(NUM_GROUP)
FROM    (SELECT      AccountID, COUNT(GroupID) AS NUM_GROUP
        FROM        GroupAccount
        GROUP BY    AccountID) AS count_group_table;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(3,)]

In [25]:
%%sql
SELECT      AccountID, COUNT(GroupID) AS NUM_GROUP
FROM        GroupAccount
GROUP BY    AccountID
HAVING      NUM_GROUP = (SELECT  MAX(NUM_GROUP)
                        FROM    (SELECT      AccountID, COUNT(GroupID) AS NUM_GROUP
                                FROM        GroupAccount
                                GROUP BY    AccountID) AS count_group_table);

 * mysql://root:***@localhost/testing_system_db
7 rows affected.

[(1, 3), (2, 3), (3, 3), (6, 3), (7, 3), (15, 3), (16, 3)]

In [26]:
%%sql
CREATE VIEW     MOST_JOINING_ACC AS
SELECT          AccountID, COUNT(GroupID) AS NUM_GROUP
FROM            GroupAccount
GROUP BY        AccountID
HAVING          NUM_GROUP = (SELECT  MAX(NUM_GROUP)
                        FROM    (SELECT      AccountID, COUNT(GroupID) AS NUM_GROUP
                                FROM        GroupAccount
                                GROUP BY    AccountID) AS count_group_table);

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [27]:
%%sql
SELECT          *
FROM            MOST_JOINING_ACC;

 * mysql://root:***@localhost/testing_system_db
7 rows affected.

[(1, 3), (2, 3), (3, 3), (6, 3), (7, 3), (15, 3), (16, 3)]

# Question 3. Tạo View có chứa Câu hỏi có Content dài hơn 70 và xóa nó đi

In [53]:
%%sql
SELECT      QuestionID, Content, LENGTH(Content) AS LEN_CONTENT
FROM        question
WHERE       LENGTH(Content) > 70;

 * mysql://root:***@localhost/testing_system_db
3 rows affected.

[(4, 'Mỗi nhân viên được cấp bao nhiêu ngày phép năm hằng tháng', 74),
 (6, 'Kể tên những mối nguy về điện trong môi trường làm việc', 74),
 (14, 'Ứng dụng sơ đồ xương cá trong phân tích nguyên nnhân gốc rễ', 78)]

In [47]:
str = 'Ứng dụng sơ đồ xương cá trong phân tích nguyên nhân gốc rễ'
print(len(str))
print(len(str.encode('utf-8')))

58
77

In [54]:
%%sql
CREATE VIEW     LONG_QUESTION AS
SELECT          QuestionID, Content, LENGTH(Content) AS LEN_CONTENT
FROM            question
WHERE           LENGTH(Content) > 70;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [56]:
%%sql
SELECT  *  
FROM    LONG_QUESTION;

 * mysql://root:***@localhost/testing_system_db
3 rows affected.

[(4, 'Mỗi nhân viên được cấp bao nhiêu ngày phép năm hằng tháng', 74),
 (6, 'Kể tên những mối nguy về điện trong môi trường làm việc', 74),
 (14, 'Ứng dụng sơ đồ xương cá trong phân tích nguyên nnhân gốc rễ', 78)]

# Question 4. Tạo View có chứa danh sách các Phòng ban có nhiều Nhân viên nhất

In [63]:
%%sql
SELECT      COUNT(AccountID)
FROM        Account
GROUP BY    DepartmentID;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(5,), (2,), (3,), (2,), (7,)]

In [66]:
%%sql
SELECT      MAX(NUM_ACC)
FROM        (SELECT     COUNT(AccountID) as NUM_ACC
            FROM        Account
            GROUP BY    DepartmentID) AS COUNT_ACC_DEPT;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(7,)]

In [71]:
%%sql
SELECT      a.DepartmentID, d.DepartmentName, COUNT(a.AccountID) NUM_ACC
FROM        Account     AS a
LEFT JOIN   Department  AS d    ON d.DepartmentID = a.DepartmentID
GROUP BY    a.DepartmentID
HAVING      NUM_ACC =   (SELECT     MAX(NUM_ACC)
                        FROM        (SELECT     COUNT(AccountID) as NUM_ACC
                                    FROM        Account
                                    GROUP BY    DepartmentID) AS COUNT_ACC_DEPT);

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(5, 'Operations', 7)]

In [73]:
%%sql
CREATE VIEW most_acc_dept AS
SELECT      a.DepartmentID, d.DepartmentName, COUNT(a.AccountID) NUM_ACC
FROM        Account     AS a
LEFT JOIN   Department  AS d    ON d.DepartmentID = a.DepartmentID
GROUP BY    a.DepartmentID
HAVING      NUM_ACC =   (SELECT     MAX(NUM_ACC)
                        FROM        (SELECT     COUNT(AccountID) as NUM_ACC
                                    FROM        Account
                                    GROUP BY    DepartmentID) AS COUNT_ACC_DEPT);

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [74]:
%%sql
SELECT  *
FROm    most_acc_dept

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(5, 'Operations', 7)]


# Question 5. Tạo View có chứa tất các các Câu hỏi do User họ Brown tạo ra

In [78]:
%%sql
SELECT      q.QuestionID, q.Content, q.CreatorID, a.FullName
FROM        Question    AS q
LEFT JOIN   Account     AS a    ON a.AccountID = q.CreatorID
WHERE       SUBSTRING_INDEX(a.FullName,' ',-1) = 'Brown';

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(9, 'Có bao nhiêu bước trong phương pháp 5S nơi làm việc', 3, 'David Brown'),
 (10, 'Kể tên những mối nguy về hóa chất có thể gặp', 3, 'David Brown'),
 (11, 'Quy định về việc trang bị đẩy đủ bảo hộ lao động', 3, 'David Brown'),
 (17, 'Công ty đang sản xuất những mặt hàng nào', 3, 'David Brown'),
 (18, 'Các lỗi sản phẩm hay gặp trong sản xuất', 3, 'David Brown')]

In [80]:
%%sql
CREATE VIEW Brown_questions AS
SELECT      q.QuestionID, q.Content, q.CreatorID, a.FullName
FROM        Question    AS q
LEFT JOIN   Account     AS a    ON a.AccountID = q.CreatorID
WHERE       SUBSTRING_INDEX(a.FullName,' ',-1) = 'Brown';

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [81]:
%%sql
SELECT  *
FROM    Brown_questions;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(9, 'Có bao nhiêu bước trong phương pháp 5S nơi làm việc', 3, 'David Brown'),
 (10, 'Kể tên những mối nguy về hóa chất có thể gặp', 3, 'David Brown'),
 (11, 'Quy định về việc trang bị đẩy đủ bảo hộ lao động', 3, 'David Brown'),
 (17, 'Công ty đang sản xuất những mặt hàng nào', 3, 'David Brown'),
 (18, 'Các lỗi sản phẩm hay gặp trong sản xuất', 3, 'David Brown')]